{"updated":"2026-02-25T04:35:29Z","count":110,"incidents":[{"id":"11118","title":"Chemical Release from Container Ship Northern Jaguar, APM Terminal; Mobile, Alabama - MX98+7P Mobile, AL, USA","lat":30.6682,"lon":-88.0332,"date":"2026-02-04T00:00:00Z","desc":"On February 4, 2026, the U.S. Coast Guard (USCG) contacted the NOAA Scientific Support Coordinator (SSC) regarding a possible release of methyl mercaptan from a hazmat container aboard the container ship Northern Jaguar. The USCG is gathering information and requested immediate hazard analysis for t","url":""},{"id":"11117","title":"Wellhead Spill, Grand Isle 25; Grand Isle, Louisiana - Grand Isle, LA, USA","lat":29.1019,"lon":-90.1233,"date":"2026-02-04T00:00:00Z","desc":"On February 4, 2026, U.S. Coast Guard (USCG) Houma received a National Response Center report regarding a spill of oil from a Cantium wellhead located in Grand Isle block #25. The leak was caused by corrosion. Cantium is reporting an estimated 1.6 gallons released into open water. The release is rep","url":""},{"id":"11116","title":"Natural Gas Explosion; Cameron, Louisiana - Cameron, LA","lat":29.7589,"lon":-93.648,"date":"2026-02-03T00:00:00Z","desc":"On February 3, 2026, U.S. Coast Guard (USCG) Lake Charles received a report of a natural gas explosion from an inactive Delfin LNG pipeline near Cameron, Louisiana. No injuries were reported. The large flame could be seen from at least 20 miles away. \u000b\u000bUSCG is requesting air plume modeling from OR&R","url":""},{"id":"11110","title":"Oil Discharge from Wellhead into West Cote Blanche Bay; Cypremort Point, Louisiana - M6J2+2H Cypremort Point, LA, USA","lat":29.68,"lon":-91.7986,"date":"2026-01-22T00:00:00Z","desc":"At 0915 local time, U.S. Coast Guard (USCG) Marine Safety Unit Morgan City contacted the NOAA Scientific Support Coordinator (SSC) regarding an oil discharge of approximately 9 barrels of crude oil from a wellhead  (NRC Incident Report #1453174) into West Cote Blanche Bay.\u000bThe report details the dis","url":""},{"id":"11107","title":"Oil Spill from TPIC Flow Line, Southwest Pass 24; Port Eads, Louisiana - Port Eads, LA, USA","lat":29.0,"lon":-89.2849,"date":"2026-01-16T00:00:00Z","desc":"On January 16, 2026 a TPIC flow line in Southwest Pass 24 spilled approximately 10 barrels of oil into marsh adjacent to the Mississippi River.  The U.S. Coast Guard requested NOAA assistance to determine appropriate cleanup techniques.. Threat: Oil. Commodity: Oil","url":""},{"id":"11101","title":"Vehicle Barge Fire in Ship Channel; Mobile, Alabama - PXJ4+4W Mobile, AL, USA","lat":30.7304,"lon":-88.0427,"date":"2026-01-12T00:00:00Z","desc":"On January 12, 2026, U.S. Coast Guard (USCG) Sector Mobile notified the NOAA Scientific Support Coordinator (SSC) of a fire aboard a salvage auto barge that caught fire and ran aground on the Mobile River downstream of the Cochrane Bridge. The USCG requested support from the NOAA SSC regarding threa","url":""},{"id":"11112","title":"Mystery Sheen, Ship Shoal 43; Gulf of America","lat":29.0242,"lon":-90.7911,"date":"2026-01-08T00:00:00Z","desc":"On January 8, 2026, NOAA NESDIS (National Environmental Satellite, Data, and Information Service) identified an anomaly in Ship Shoal 43, off the coast of Terrebonne Parish, Louisiana. \u000b\u000bPHMSA (the Pipeline and Hazardous Materials Safety Administration) and the State of Louisiana have initiated an e","url":""},{"id":"11099","title":"Crude Oil Release at TPIC SL 1923 #28 Well; Pilottown, Louisiana - Pilottown, LA, USA","lat":29.0885,"lon":-89.2751,"date":"2026-01-06T00:00:00Z","desc":"At approximately 0815 hours on January 5, 2026, Texas Petroleum Investment Company (TPIC) discovered a leak on a 6-inch injection line that is associated with the SL 1923 #28 Well northeast of their W-1 Facility in the South Pass 24 Oil & Gas Field (Plaquemines Parish, Louisiana). It was estimated t","url":""},{"id":"11094","title":"Hydrogen Sulfide Release at Refinery; Pascagoula, Mississippi - 8GR7+R7 Pascagoula, MS, USA","lat":30.3421,"lon":-88.4868,"date":"2025-12-29T00:00:00Z","desc":"On Dec. 29, 2025, U.S. Coast Guard Sector Mobile contacted the NOAA Scientific Support Coordinator (SSC) regarding a fugitive air release of Hydrogen Sulfide (H2S) gas from the Chevron Pascagoula refinery. The release was reported to be ~115 lbs of H2S. The SSC provided hazard assessment and recomme","url":""},{"id":"11088","title":"Crude Oil Spill at Hilcorp Asset; Terrebonne Bay, Louisiana - LA","lat":29.2117,"lon":-90.5031,"date":"2025-11-23T00:00:00Z","desc":"On November 23, 2025, an asset of Hilcorp released an unknown quantity of crude oil into Terrebonne Bay, Louisiana. The release produced a 2-mile slick/sheen. The release has been secured. An Oil Spill Response Organization (OSRO) was onsite. The U.S. Coast Guard requested a fate and trajectory anal","url":""},{"id":"11083","title":"Pipeline Leak; Breton Sound, Louisiana - LA","lat":29.5783,"lon":-89.1172,"date":"2025-11-14T00:00:00Z","desc":"On November 14, 2025, the U.S. Coast Guard (USCG) received National Response Center report #1447893 describing a mystery sheen in Breton Sound.  USCG requested NOAA support to identify the likely direction of origin.  A USCG Auxiliary overflight identified a Texas Petroleum Investment Company (TPIC)","url":""},{"id":"11082","title":"Produced Water Leak from Pipeline; Dauphin Island, Alabama - Dauphin Island AL, USA","lat":30.3749,"lon":-88.0908,"date":"2025-11-12T00:00:00Z","desc":"At 1100 local time, Sector Mobile Alabama notified the local NOAA Scientific Support Coordinator (SSC) of a dull sheen, approximately 10 miles long, originating from a pipeline carrying produced water, which may consist of oily water mixture.  The SSC on duty was notified. The U.S. Coast Guard (USCG","url":""},{"id":"11084","title":"Flowline Leak and In Situ Burn; South Pass 24, Louisiana - LA","lat":29.0403,"lon":-89.3286,"date":"2025-11-11T00:00:00Z","desc":"On November 11, 2025, the U.S. Coast Guard (USCG) received a National Response Center (NRC) report for a 50-barrel crude oil discharge from a 3-inch Texas Petroleum Investment Company (TPIC) flow line into 1/2 acre of marsh in the South Pass 24 block. The source is secured. An oil spill removal orga","url":""},{"id":"11080","title":"Oil Discharge at Castex Energy–Lafourche 23 #1 Well Site; Golden Meadow, Louisiana - Golden Meadow, LA, USA","lat":29.3453,"lon":-90.2136,"date":"2025-10-31T00:00:00Z","desc":"On October 31, 2025 Castex Energy Lafourche 23 Well #1 began discharging natural gas, produced water, and gas condensate into the air,  surrounding marsh, and waterway.  \u000b\u000bRelease is ongoing.  An Oil Spill Response Organizations (OSRO) is onsite conducting cleanup, containment, and air monitoring op","url":""},{"id":"11077","title":"Low Sulphur Fuel Oil Spill; Galveston, Texas - 855V+72, Galveston, TX, USA","lat":29.3083,"lon":-94.8061,"date":"2025-10-29T00:00:00Z","desc":"The U.S. Coast Guard (USCG) Marine Safety Unit Texas City contacted the NOAA Emergency Spill Line at approximately 0600 (CDT) Oct. 29, 2025. The USCG received notification of a release of an estimated 4400 gallons of Low Sulphur Fuel Oil that occurred at Pier 32 in Galveston Harbor. USCG received\u000bno","url":""},{"id":"11076","title":"Sunken Shrimp Boat; St. Petersburg, Florida - St. Petersburg, FL, USA","lat":27.6239,"lon":-82.6575,"date":"2025-10-21T00:00:00Z","desc":"On Tuesday, October 21, 2025 at 0730, the NOAA Scientific Support Coordinator (SSC) was notified of a shrimp vessel that had crashed into the Sunshine Skyway in St. Petersburg, Florida.  The vessel's maximum potential discharge is 6,000 gallons of diesel fuel.  The U.S. Coast Guard (USCG) is plannin","url":""},{"id":"11072","title":"Fire and Oil Spill on Commercial Fishing Vessel; Breton Sound, Louisiana - Breton Sound, LA","lat":29.4762,"lon":-89.2434,"date":"2025-10-03T00:00:00Z","desc":"On October 3, 2025, the commercial fishing vessel PHUOC THANH MAI III caught fire in Breton Sound, Louisiana, with 25,000 gallons of diesel onboard. The U.S. Coast Guard (USCG) requested from NOAA a fate and trajectory for a potential discharge.. Threat: Oil","url":""},{"id":"11069","title":"Mystery Sheens in Main Pass, Louisiana","lat":29.2531,"lon":-89.0447,"date":"2025-09-22T00:00:00Z","desc":"Multiple MPSRs (Marine Pollution Surveillance Reports) from the National Environmental Satellite, Data, and Information Service (NESDIS) from September 22 through 25, and reports from earlier months, indicate a persistent leak in the Main Pass area. \u000b\u000bAfter investigation from the U.S. Coast Guard (U","url":""},{"id":"11063","title":"Fuel Oil Spill: M/V MSC VANCOUVER and Fuel Barge; Morgan's Point, Texas - M2J2+QX Morgan's Point, TX, USA","lat":29.682,"lon":-94.9975,"date":"2025-09-05T00:00:00Z","desc":"Incident details: On Sept. 5, 2025, the M/V MSC VANCOUVER was moored at the Port of Houston Barbours Cut Terminal while taking on bunkers of RMG 380/No. 6 fuel oil (heavy fuel oil) when a valve was accidentally opened prior to connecting the transfer hose, discharging approximately 3 barrels onto th","url":""},{"id":"11057","title":"Satellite Imagery Report, High Island 170 Block; Gulf of America - Gulf of America 76X75XR4+97","lat":29.1909,"lon":-94.0443,"date":"2025-08-26T00:00:00Z","desc":"At 1723 local time, NOAA National Environmental Satellite, Data, and Information Service issued Marine Pollution Surveillance Report (image collected 8/25/2025, 1648 UTC) for a location in High Island 170 Block, Gulf of America, approximately 35 miles south-southwest of Sabine Pass. U.S. Coast Guard","url":""},{"id":"11060","title":"Smitty's Supply Fire (EPA Lead); Roseland, Louisiana - 63399 US-51, Roseland, LA 70456, USA","lat":30.776,"lon":-90.5123,"date":"2025-08-22T00:00:00Z","desc":"On August 22, 2025, at 1:13 pm CT, the Environmental Protection Agency (EPA) was notified by the Louisiana State Police (LSP) of an explosion and fire from above-ground storage tanks at the Smitty’s Supply Inc. facility located in the Tangipahoa Parish, Louisiana. According to the LSP, the cause of ","url":""},{"id":"11055","title":"Mystery Sheen, Petit Bois Pass; Dauphin Island, Alabama - 7J3F+MJ Dauphin Island, AL, USA","lat":30.2542,"lon":-88.3759,"date":"2025-08-21T00:00:00Z","desc":"At approximately 1545 local time, a U.S. Coast Guard (USCG) helicopter conducting a training overflight spotted a surface anomaly in the vicinity of the pass between Petit Bois and Dauphin Island. USCG Sector Mobile Incident Management Division conducted follow-up investigations with Chevron at Bayo","url":""},{"id":"11054","title":"Oil Spill in Timbalier Bay; Port Fourchon, Louisiana - Port Fourchon, LA, USA","lat":29.0831,"lon":-90.3183,"date":"2025-08-20T00:00:00Z","desc":"On August 18, 2025 the U.S. Coast Guard (USCG) received National Response Center Report #1440248 regarding a discharge of approximately 10 barrels of a crude oil/produced water mixture from a 12-inch bulk line operated by Extex Operating Company in Timbalier Bay, Louisiana.\u000b\u000bPoint source is a valve ","url":""},{"id":"11051","title":"Discharge from Abandoned Wellhead, South Pass 28; Port Eads, Louisiana - Port Eads, LA, USA","lat":28.9969,"lon":-89.254,"date":"2025-08-18T00:00:00Z","desc":"On August 15, 2025, the U.S. Coast Guard (USCG) received notification (National Response Center 1439943) of an abandoned Whitney wellhead that was discharging into South Pass 28. \u000b\u000bUSCG contracted ES&H to secure the release and conduct cleanup.. Threat: Oil","url":""},{"id":"11049","title":"Benzene Discharge from Barge into Neches River; Port Neches, Texas - X3WM+HQ Port Neches, TX, USA","lat":29.9964,"lon":-93.9156,"date":"2025-08-14T00:00:00Z","desc":"On August 14, 2025, the U.S. Coast Guard (USCG) received a report that a barge carrying 4,000 barrels of benzene was struck by another barge and released benzene into the waters in the barge fleeting area, along the Neches River near the Port of Neches.\u000bThe release is believed to be from the starboa","url":""},{"id":"11033","title":"Oil Spill into Delta National Wildlife Refuge; Pilottown, Louisiana - Pilottown, LA, USA","lat":29.2531,"lon":-89.2036,"date":"2025-07-11T00:00:00Z","desc":"Initial Report:  On 11 July 2025, U.S. Coast Guard (USCG) received notification of a TPIC 10+ barrel crude oil spill into Delta National Wildlife Refuge. The release is not yet secure. Potential in situ burn. \u000b\u000bUSCG is requesting onsite support.. Threat: Oil. Commodity: Crude oil","url":""},{"id":"11032","title":"Methacrylic Acid Release into Mississippi River; St Rose, Louisiana - 10801 River Rd, St Rose, LA 70087, USA","lat":29.959,"lon":-90.302,"date":"2025-07-03T00:00:00Z","desc":"Initial Report:  03 July, the U.S. Coast Guard (USCG) received a report of 12,000 lbs methacrylic acid (CAS 79-41-4) released into the Mississippi River at 10800 River Road, St Rose, Louisiana. \u000b\u000bUSCG requested a hazard summary.. Threat: Chemical","url":""},{"id":"11031","title":"Potential Discharge of Oil, West Cameron Block 2, Cameron Parish, Louisiana - QR55+HF Cameron, LA, USA","lat":29.7589,"lon":-93.1913,"date":"2025-07-02T00:00:00Z","desc":"Initial Report:  On 2 July, 2025, U.S. Coast Guard (USCG) Marine Safety Unit (MSU) Lake Charles contacted the NOAA Scientific Support Coordinator (SSC) regarding a potential discharge of oil in the vicinity of West Cameron, Cameron Parish, Louisiana. National Response Center report #1435773 was issu","url":""},{"id":"10997","title":"Potential Discharge from 60-foot Sailboat; Cape Canaveral, Florida - Cape Canaveral, FL, USA","lat":28.4073,"lon":-80.5659,"date":"2025-06-28T00:00:00Z","desc":"U.S. Coast Guard responded to a 60-ft sailboat that caught fire on 28 JUN 2025 and then sank at approximately 1630 EST. USCG requested NOAA's support for providing a fate analysis for the incident. Total potential for discharge is 200 gallons of No 2 Diesel Fuel.  LAT/LONG 28-24.440N 080-33.941W. On","url":""},{"id":"10996","title":"Potential Discharge of Oil from Flowline; Vicinity of Lake Barre, Louisiana - 76XF6GRF+92","lat":29.241,"lon":-90.4775,"date":"2025-06-27T00:00:00Z","desc":"On 27 JUNE 2025, USCG MSU Houma contacted the NOAA SSC regarding a potential discharge of oil in vicinity of Lake Barre, Terrebonne Parrish, LA. NRC report #1435335 was received by USCG at 1311 local indicating a  3 mile by 0.75 sheen observed by local fishing vessel at 11:15 local time. USCG contac","url":""},{"id":"10984","title":"Mystery Oil Slick in Breton Sound Block 51; Gulf of America","lat":29.443,"lon":-89.0988,"date":"2025-06-09T00:00:00Z","desc":"07 JUN a 300 yards black slick was observed in Breton Sound Block 51. \u000b\u000bUSCG was not able to locate the slick on 08 JUN.  \u000b\u000bUSCG requested trajectory assistance from NOAA on 09 JUN.. Threat: Oil","url":""},{"id":"10986","title":"Mystery Sheen in Alaminos Canyon 687; offshore Texas, Gulf of America - Texas Gulf","lat":26.31,"lon":-94.6183,"date":"2025-06-01T00:00:00Z","desc":"01 JUN: USCG in Brownsville, Texas received a National Environmental Satellite, Data, and Information Service (NESDIS) report for a potential 20nm long sheen in Alaminos Canyon 687.  USCG requested NOAA SSC assistance with coordinating next available imagery and analysis from NESDIS.. Threat: Oil","url":""},{"id":"10987","title":"Oil Spill from Platform in Eloi Bay; offshore Louisiana, Gulf of America - LA, Gulf","lat":29.7682,"lon":-89.3783,"date":"2025-05-29T00:00:00Z","desc":"29 MAY USCG Sector New Orleans received a report of dark oil discharging from a near-shore oil platform in Eloi Bay.  \u000b\u000bUSCG requested NOAA trajectory assistance.. Threat: Oil","url":""},{"id":"10988","title":"Mystery Sheens: Ship Shoal 276; offshore Louisiana, Gulf of America","lat":28.0,"lon":-91.0933,"date":"2025-05-25T00:00:00Z","desc":"NOAA National Environmental Satellite, Data, and Information Service (NESDIS) has been tracking several anomalies since 25 MAY 2025 originating from a single location in Ship Shoal 276. \u000b\u000bThis location is just west of an old MonForte platform (Ship Shoal 277) that is currently being decommissioned b","url":""},{"id":"10970","title":"Overflow of TPIC Tank at Romere Pass Facility; Boothville-Venice, Louisiana - Boothville-Venice, LA, USA","lat":29.3296,"lon":-89.2242,"date":"2025-05-23T00:00:00Z","desc":"May 23, 2025, 0600 CDT: TPIC tank at Romere Pass facility overflowed into secondary containment. At least 50 bbl escaped containment into the waterway.\u000b\u000bSpill location was given as: 29º 16’ 31”N–89º 14’ 35”W\u000b\u000bAt 1000 CDT, an overflight indicated the NW leading edge was at: 29°19′45″N–89°13′9″W. \u000b\u000bUS","url":""},{"id":"10968","title":"Well Discharge, Lobo Operating Grand Bay; Venice, Louisiana - Venice, LA, USA","lat":29.3539,"lon":-89.2925,"date":"2025-05-20T00:00:00Z","desc":"20 MAY 2025:  A Lobo Operating, Inc. well discharged at least 15bbl of crude oil onto water adjacent to a marsh and tidal flat.  The area of impact is approximately 40 x 100 yards. \u000b\u000bRelease was secured at approximately 0800 21 MAY. \u000b\u000bOSROs onsite conducting cleanup operations. USCG requesting NOAA ","url":""},{"id":"10985","title":"Oil Spill in South Lake Hatch Oil Field; Houma, Louisiana - Houma, LA, USA","lat":29.5158,"lon":-90.8639,"date":"2025-05-13T00:00:00Z","desc":"13 MAY:  Whitney Oil and Gas notified USCG Houma of a 200ft by 250ft sheen produced by crude oil in the South Lake Hatch oil field.\u000b\u000bWell was shut in and line isolated. \u000b\u000b05 JUN: USCG Houma requested NOAA SSC assistance to determine appropriate clean up methods including consideration of an In situ ","url":""},{"id":"10964","title":"Well #59 Incident: Well Blowout, Garden Island Bay; Port Eads, Louisiana - Port Eads, LA, USA","lat":29.075,"lon":-89.18,"date":"2025-04-26T00:00:00Z","desc":"At 1700 on 26 APR 2025, USCG Sector New Orleans contacted the NOAA SSC regarding a reported well blowout in a marsh area near Garden Island Bay Pass-a-Loutre Wildlife Management Area, LA. The discharge rate is currently unknown.  The USCG requested NOAA prepare an oil fate and trajectory and identif","url":""},{"id":"10961","title":"Barge Allision and Discharge of Ethanol; Melville, Louisiana - Melville, LA, USA","lat":30.6908,"lon":-91.733,"date":"2025-04-21T00:00:00Z","desc":"On April 21, 2022, a Florida Marine Transportation Barge 3112 allided with a bridge in Melville, LA at mm 30 of the Atchafalaya River along the left descending bank.  The barge was carrying a total of 14k bbl (approx 600,000 gallons) of ethanol distributed between 4 tanks.  One of the tanks is damag","url":""},{"id":"10960","title":"Oil Spill at Apache Corporation West Delta Platform; SE of Grand Isle, Louisiana - LA","lat":28.9378,"lon":-89.6597,"date":"2025-04-21T00:00:00Z","desc":"On April 31, 2025 an Apache Corporation Platform approximately 25 miles southeast of Grand Isle in West Delta released 20-50bbl of crude oil into the Gulf.  \u000b\u000bNOAA provided initial trajectory.. Threat: Oil. Commodity: crude oil","url":""},{"id":"10958","title":"Satellite Imagery Documents Sheen; TPIC Main Pass 81 B, South Platform, Louisiana - LA","lat":29.2411,"lon":-89.0761,"date":"2025-04-14T00:00:00Z","desc":"On April 14, 2025, a NESDIS Marine Pollution Surveillance Report (MPSR) documented sheen adjacent to Texas Petroleum Investment Company (TPIC) Main Pass 81 B South Platform.  Southern SeaPlane conducted an overflight at 2pm in this immediate area and reported sheen and provided low resolution photog","url":""},{"id":"10957","title":"F/V Miss Jodie Ashore, Flagler Beach, South of St Augustine, Florida - 2469 N Ocean Shore Blvd, Flagler Beach, FL 32136,","lat":29.5118,"lon":-81.1417,"date":"2025-04-14T00:00:00Z","desc":"On April 14, 2025, USCG Sector Jacksonville notified the SSC that a 50 foot, steel hulled fishing vessel broke anchor and came ashore at Flagler Beach south of St Augustine, Florida yesterday. Vessel has 300 gallons of diesel aboard. No damage to the vessel or pollution has been reported at this tim","url":""},{"id":"10956","title":"Satellite Imagery Identifies Potential Oil Spill; TPIC Wellhead, Main Pass JK North, Louisiana - LA","lat":29.285,"lon":-89.0986,"date":"2025-04-11T00:00:00Z","desc":"On April 10, a NESDIS Marine Pollution Surveillance Report (MPSR) identified a potential oil spill east of the delta.  On April 11, the U.S. Coast Guard's investigation revealed that a pin hole leak in a 4-inch flow line, leading to a Texas Petroleum Investment Company (TPIC) wellhead in Main Pass b","url":""},{"id":"10955","title":"Satellite Imagery identifies Potential Oil Spill; Main Pass 81, Wellhead 36, Louisiana - LA","lat":29.2109,"lon":-89.0681,"date":"2025-04-11T00:00:00Z","desc":"On April 10, 2025, a NESDIS Marine Pollution Surveillance Report (MPSR) identified a potential oil spill east of the delta.  On 11 APR: USCG investigation revealed that a pin hole leak in a 4-inch flow line leading to Texas Petroleum Investment Company (TPIC) Wellhead 36 resulted in an approximately","url":""},{"id":"10952","title":"Leak in Flowline Detected by Satellite Imagery; Triumph, Louisiana - Triumph, LA, USA","lat":29.4556,"lon":-89.3969,"date":"2025-04-09T00:00:00Z","desc":"On April 9, 2025, a NESDIS Marine Pollution Surveillance Report (image taken 08 APR 1657 UTC) identified a leaking TPIC asset.   10 APR USCG contacted TPIC regarding the report.  TPIC had not previously reported the leak. TPIC confirmed with USCG that a pinhole leak on a riser from a 4in flowline wa","url":""},{"id":"10945","title":"TPIC Facility Condensate and Oil Release; Southwest Pass and Cockler Bay, Louisiana - Southwest Pass and Cockler Bay LA,","lat":29.0814,"lon":-89.2833,"date":"2025-04-01T00:00:00Z","desc":"On April 1, 2025, a Texas Petroleum Investment Company (TPIC) facility was reportedly spraying condensate and oil in the vicinity of Southwest Pass.  The resulting sheen was spotted as far as 2 miles south in Cockler Bay.  The reported quantity released is 5 bbl.  TPIC Oil Spill Response Organizatio","url":""},{"id":"10942","title":"Mystery Sheen, Main Pass 24; Gulf of America","lat":29.5017,"lon":-89.4561,"date":"2025-03-29T00:00:00Z","desc":"On March 28, 2025, the NOAA NESDIS satellite surveillance program reported a mystery sheen in Main Pass 24 in the Gulf of America. The reported sheen was as long as 11nm.  On 29 MAR, a USCG overflight confirmed the presence of oil on water.  Oil producers in the vicinity of the sheen did not report ","url":""},{"id":"10932","title":"Leak in Underwater Transfer Line, Whitney Gas Lake Hatch Main Facility; Houma, Louisiana - Houma, LA, USA","lat":29.5382,"lon":-90.8508,"date":"2025-03-08T00:00:00Z","desc":"On 3/8/25, Coast Guard MSU Houma contacted the NOAA SSC regarding NRC Report 1425362.  The report indicated a discharge of approximately 2 barrels of crude oil from a pinhole leak in a 4-inch underwater transfer line at Whitney Gas Lake Hatch Main facility.  Facility personnel have bled down and shu","url":""},{"id":"10933","title":"Three-Yacht Fire on the Miami River; Miami, Florida - 3601 NW S River Dr, Miami, FL 33142, USA","lat":25.8008,"lon":-80.2522,"date":"2025-03-07T00:00:00Z","desc":"On March 11, 2025, the USCG Sector Miami Command Center (SECMIA) received a report from Miami-Dade Fire Rescue (F/R) regarding three large moored and unoccupied vessels on fire at the Chamonix Marina on the Miami River. Initially, Miami-Dade Fire Rescue requested only a safety broadcast, with no Coa","url":""},{"id":"10929","title":"Spill into Intracoastal Waterway; Lafayette, Louisiana - Alice B, LA, USA","lat":29.8051,"lon":-91.8197,"date":"2025-03-03T00:00:00Z","desc":"03 March 2025:   The Texas Petroleum Investment Company (TPIC) Weeks Island Facility reported a spill of approximately 15 barrels of crude oil into the Intracoastal Waterway and adjacent marsh. \u000b\u000bThe release was contained and an Oil Spill Removal Organization (OSRO) onsite.  In-Situ Burn (ISB) is be","url":""},{"id":"10925","title":"South Florida Tarball Reports, Feb 23, 2025; Jupiter, Florida - 100 Ocean Trail Way, Jupiter, FL 33477, USA","lat":26.9349,"lon":-80.0694,"date":"2025-02-23T00:00:00Z","desc":"USCG contacted the SSC at 1000 on 23 Feb 2025 to report that tarballs have been reported north of Lake Worth Inlet and on Jupiter and Stuart Beaches. Initial distribution estimates are about 1 tarball every foot in areas of concentration. USCG is on-scene to further assess the contamination and will","url":""},{"id":"10923","title":"Sulfur Dioxide Released at Refinery; Pascagoula, Mississippi - Pascagoula, MS, USA","lat":30.3425,"lon":-88.493,"date":"2025-02-21T00:00:00Z","desc":"On February 21, 2025, the USCG contacted the NOAA SSC regarding a reported release of an estimated 1,026 lbs. of sulfur dioxide from the Chevron Pascagoula refinery.  The NOAA SSC provided a hazard assessment and threat analysis via CAMEO and MARPLOT.  It has been reported that the release lasted fo","url":""},{"id":"10913","title":"Produced Water Spill from W&T Offshore, Inc.; Gulf of America","lat":29.2975,"lon":-88.9206,"date":"2025-02-09T00:00:00Z","desc":"On February 7, 2025, W&T Offshore, Inc. *WTI) released an unknown amount of produced water (and associated oil) into the Gulf of America.  This release has resulted in multiple NESDIS Marine Pollution Surveillance reports stretching over a total of 50 miles offshore.. Threat: Oil","url":""},{"id":"10914","title":"TPIC Well #58 Main Pass Oil Spill; Main Pass 80","lat":29.2242,"lon":-89.0667,"date":"2025-01-27T00:00:00Z","desc":"Starting Feb 03 2025,  the NOAA SSC was notified that NESIDS SAB and USCG tracked multiple reports of sheen in the Main Pass area of the Mississippi River.  The USCG eventually identified TPIC Well #58 as the likely source of the sheen.  This well was shut in.. Threat: Oil","url":""},{"id":"10906","title":"Mystery Sheen and Oiled Shoreline; Bay Long, Louisiana - LA, USA","lat":29.32,"lon":-89.8108,"date":"2025-01-27T00:00:00Z","desc":"On January 27, 2025, the Louisiana Dept of Wildlife and Fisheries (LDWF) reported oiled shoreline, sheen in Bay Long and Lake Grand Ecaille.  LDWF also reported dead and oiled birds along the impacted shoreline.  \u000bHilcorp is responding to the spill.  Hilcorp also reported a 5bbl crude oil spill in t","url":""},{"id":"10904","title":"Leak in TPIC Black Lake Tank Battery 5 Flowline; Hackberry, LA","lat":30.0008,"lon":-93.4292,"date":"2025-01-27T00:00:00Z","desc":"On January 27, 2025, MSU Lake Charles notified NOAA SSC about a pinhole leak in a  Texas Petroleum Investment Company (TPIC pipeline), located in Black Lake, LA (NRC#1421912).  Incident occurred at 0845 local time, an estimated 30 gallons of crude oil was discharged.  Source is secure, and OSROs are","url":""},{"id":"10903","title":"South Lake Hatch Oil Spill from Whitney Oil & Gas platform; Houma, LA - Houma, LA, USA","lat":29.5203,"lon":-90.8741,"date":"2025-01-26T00:00:00Z","desc":"On January 26, 2025, a gasket failure on a Whitney Oil and Gas platform resulted in a release of 3-4 bbl produced water and crude oil onto water.  The Incident location is approximately 2 miles west of Mandalay National Wildlife Refuge but the refuge is not expected to be impacted.. Threat: Oil. Com","url":""},{"id":"10915","title":"Hilcorp facility Lone Oak Bayou Oil Spill; LA","lat":29.5806,"lon":-91.5055,"date":"2025-01-24T00:00:00Z","desc":"On January 24, 2025, the USCG unit at Morgan City, LA, notified the NOAA SSC regarding a reported 5bbl spill from a Hilcorp facility onto the water and impacting adjacent wetlands. SSC discussed the potential for mobilization of oil from the site and the Atchafalaya Delta Wildlife Management Area.. ","url":""},{"id":"10916","title":"MV PATRICK J STUDDERT and Cargo Ship CLARA B Collision; Destrehan, LA, USA","lat":29.9458,"lon":-90.3811,"date":"2024-12-31T00:00:00Z","desc":"On December 29,  2024, the MV PATRICK J. STUDDERT, an 87ft towboat collided with the bulk cargo ship CLARA B near Mississippi River mm122.5 just upriver from Luling, LA. The tugboat sank in the vicinity of the collision. \u000bA portion of the Mississippi River was closed for 3 hours. SSC was notified by","url":""},{"id":"10888","title":"M/V Dalma Marine Gas Oil Discharge; Beaumont, TX - TX, USA","lat":30.0711,"lon":-94.0569,"date":"2024-12-18T00:00:00Z","desc":"On December 17, 2024, at approximately 0700 central, the M/V Dalma discharged a reported 650 gallons of marine gas oil (MGO) into the Neches River, Beaumont, TX, during heavy fog (NRC#1410146, 1419153,1419202).  MGO discharged has an API of 29.2 and a very low sulfur content (<0.1 by mass).  No resp","url":""},{"id":"10890","title":"Mystery Sheen in Main Pass 69; Main Pass, LA","lat":29.248,"lon":-89.1189,"date":"2024-12-17T00:00:00Z","desc":"On December 17, 2024, the USCG received reports of a mystery sheen in Main Pass 69, Louisiana.  Sheen appeared to originate from an abandoned TPIC platform.  The source of the sheen was not confirmed. NOAA was asked to evaluate photos.. Threat: Oil","url":""},{"id":"10885","title":"Diesel Release; Galena Park, TX - Galena Park, TX, USA","lat":29.728,"lon":-95.2259,"date":"2024-12-11T00:00:00Z","desc":"On 11-DEC-24, USCG Sector Houston-Galveston contacted NOAA aSSC for Region 6 about a diesel fuel release that occurred on a tanker during a fuel transfer at the Kinder Morgan Dock 2 in Galena Park, TX. During the transfer 2 barrels of diesel marine fuel was released onto the deck of the vessel with ","url":""},{"id":"10892","title":"Mystery Sheens Main Pass 81; Gulf of Mexico","lat":29.2523,"lon":-89.084,"date":"2024-12-10T00:00:00Z","desc":"On December 10, 2024, NOAA received reports of mystery sheens in Main Pass 81 and several miles to the east, south of the Chandeleur Islands.  The largest sheen observation was 34 miles in length.  Related NRC reports: #1418539 and #1418404.  NOAA provided trajectory and assistance identifying possi","url":""},{"id":"10881","title":"Mystery Sheen; Main Pass 81, Louisiana - LA","lat":29.2523,"lon":-89.084,"date":"2024-12-10T00:00:00Z","desc":"On December 10, 2024, the USFW received a report of a 32 mile light sheen originating from a bubbling source in Main Pass 81.  USCG is investigating the source of the sheen.  NOAA will provide trajectory.. Threat: Oil","url":""},{"id":"10893","title":"Delta Duck Octave Pass Mystery Sheen; Pilottown, LA, USA","lat":29.247,"lon":-89.1988,"date":"2024-12-08T00:00:00Z","desc":"On December 8, 2024, the USFW notified the NOAA SSC of a mystery sheen in Delta National Wildlife Refuge.  The Texas Petroleum Investment Company (TPIC) tested their infrastructure in the area and reported no potential sources.  NOAA provided a hindcast. No source was identified.. Threat: Oil","url":""},{"id":"10880","title":"Delta National Wildlife Refuge / Octave Pass Mystery Sheen; Pilottown, LA - Pilottown, LA, USA","lat":29.2471,"lon":-89.1999,"date":"2024-12-08T00:00:00Z","desc":"On December 8, 2024, the NOAA SSC was notified by USFWS of a mystery sheen in the Delta National Wildlife Refuge from a TCIP Duck oil field.  TPIC reported that the sheen was originating west of their wells and passing east through Octave Pass. NOAA assessed images of the spill and provided an opini","url":""},{"id":"10876","title":"Hydraulic Leak at Formosa Plastics Facility; Point Comfort, TX - Point Comfort, TX, USA","lat":28.6803,"lon":-96.5613,"date":"2024-11-26T00:00:00Z","desc":"On 26-NOV-24, USCG MSU Victoria contacted NOAA Region 6 aSSC to receive cleanup recommendations for a hydraulic leak that occurred at the Formosa Plastics Corporation Facility in Point Comfort, TX. The leak occurred on a hydraulic line of a crane at the facility, which sprayed and left an impacted a","url":""},{"id":"10891","title":"Hilcorp SM214 Spill Marsh Island; Gulf of Mexico","lat":29.4438,"lon":-91.908,"date":"2024-11-22T00:00:00Z","desc":"On November 22, 2024, the USCG received reports of a continuous release of crude oil, natural gas, and water from shut-in Hilcorp platform SM214.  The slick/sheen was initially reported to be 7 miles long.  NOAA produced a trajectory. Threat: Oil. Commodity: Crude Oil","url":""},{"id":"10874","title":"Tug Kathy Pawg Sunk; Galveston Bay, TX - Galveston Bay, TX, USA","lat":29.5536,"lon":-94.9181,"date":"2024-11-21T00:00:00Z","desc":"On 21-NOV-24, USCG Sector Houston-Galveston IMD contacted NOAA acting Region 6 SSC to notify them of the sunken Tug Kathy Pawg, which allided with a dredging line and sank in Galveston Bay, TX at 1330 central time. The tug sank with a max capacity of 11,000 gallons of red dye diesel aboard and it is","url":""},{"id":"10866","title":"Grounded Sailboat; Palm Coast, FL - 23 Ocean Dune Cir, Palm Coast, FL 32137, USA","lat":29.6236,"lon":-81.1933,"date":"2024-10-30T00:00:00Z","desc":"On October 30, 2024, the USCG notified NOAA of a sailing vessel aground on Palm Coast, FL.  The vessel has approximately ten gallons of diesel onboard.  NOAA was consulted regarding sea turtles.  but nesting season is almost over.  Florida Department of Environmental Protection Northeast District ha","url":""},{"id":"10860","title":"Hurricane Milton - Central Gulf Coast of Florida, USA","lat":27.8,"lon":-82.53,"date":"2024-10-07T00:00:00Z","desc":"USCG D7 and Sector Tampa/St Petersburg, FL are making preparations for hurricane Milton response and requested NOAA SSC support. The storm is classified as a category 5 before noon on 7 Oct, 2024. USCG D7 has initiated an MA request with FEMA for target identification and SSC support. Sector Tampa/S","url":""},{"id":"10856","title":"Hurricane Helene; Big Bend Region, Florida","lat":29.8171,"lon":-84.2926,"date":"2024-09-25T00:00:00Z","desc":"Hurricane Helene is moving northward in the eastern Gulf of Mexico and is expected to cross the Florida Big Bend coast Thursday evening, September 26.  Helene is expected to be a major hurricane when it reaches the Florida Big Bend coast.  This hotline has been opened to capture information in advan","url":""},{"id":"10851","title":"Mystery Sheen; offshore East Cameron, LA - East Cameron, LA, Block 328C","lat":28.18,"lon":-92.6944,"date":"2024-09-13T00:00:00Z","desc":"On 13-SEP-24, USCG MSU Port Arthur contacted the NOAA NW RRO to notify them of a mystery sheen about 125 NM offshore of East Cameron, LA. The sheen was first reported on 12-SEP by Arena Offshore while they were inspecting their platforms post Hurricane Francine and is confident that it is not from t","url":""},{"id":"10848","title":"Tropical Storm/Hurricane Francine; Louisiana Coast","lat":29.2582,"lon":-91.6589,"date":"2024-09-10T00:00:00Z","desc":"NOAA ERD has been monitoring the track and development of Tropical Storm Francine which is forecast to become a hurricane and make landfall on 11 SEP 2024 on the Louisiana coast. Impacts may extend from Houston, TX through Mobile, AL. The system is expected to strengthen prior to landfall; forecasts","url":""},{"id":"10846","title":"Leachate Release into Tucker Bayou; LaPorte, TX - Clean Harbor Deer Park, TX, USA","lat":29.7265,"lon":-95.0975,"date":"2024-09-01T00:00:00Z","desc":"On 1-SEPT-24, USCG Sector Houston Galveston contacted the NOAA Acting Region 6 SSC to notify them of a 350,000 gallons release of Leachate (water that has percolated through a solid and leached out some of the constituents) into Tucker Bayou from a combined landfill and waste water treatment facilit","url":""},{"id":"10832","title":"Satellite Image Anomaly (Potential Spill) East of the Delta Wildlife Refuge; southeast LA - Mississippi River, Main Pass","lat":29.2282,"lon":-89.0727,"date":"2024-08-05T00:00:00Z","desc":"On 8/5/2024, the NOAA SSC received a NESDIS report and inquiry from USFWS for a potential spill east of the Delta Wildlife Refuge (SE LA).  The satellite imagery was collected on 8/4, indicating an anomaly (possible oil) approximately 6.45 nm long and 0.22 nm wide.  Further investigation from USCG o","url":""},{"id":"10830","title":"Tropical Storm/Hurricane Debby - Big Bend region, FL","lat":29.0754,"lon":-84.0234,"date":"2024-08-04T00:00:00Z","desc":"On August 4, 2024, NOAA ERD opened this hotline to capture information on the track and development of tropical storm Debby which is forecast to become a hurricane and make landfall between Tampa and Apalachicola, Florida.  USCG Seventh District will establish an area command tomorrow (Aug 5 2024) a","url":""},{"id":"10829","title":"Oil Discharge into Joseph Bayou; Port Eads, LA - Port Eads, LA, USA","lat":29.0569,"lon":-89.3033,"date":"2024-08-02T00:00:00Z","desc":"On 8/2/24, USCG (SEC NOLA) contacted the SSC regarding a reported spill of crude oil into Joseph Bayou near Cockler Bay in vicinity of SW Pass MS River, LA. The report indicated approx. 10 bbls of crude oil believed to have leaked from the nearby inactive production facility operated by Whitney Oil ","url":""},{"id":"10827","title":"Sunken F/V TWO SS THREE LS; offshore Corpus Christi, TX - Offshore Corpus Christi, TX","lat":27.1593,"lon":-97.1383,"date":"2024-07-28T00:00:00Z","desc":"On 28-JUL-2024, USCG Sector Corpus Christi contacted their NOAA SSC to request oil fate information for a sunken fishing boat roughly 12 miles offshore of Padre Island National Seashore, near Baffin Bay.  The F/V TWO SS THREE LS sank in 40’ of water earlier in the day with 2,000 gallons diesel repor","url":""},{"id":"10826","title":"Crescent Midstream Tank Overflow into Bayou Lafourche; Raceland, LA - Raceland, LA , USA","lat":29.7272,"lon":-90.5956,"date":"2024-07-27T00:00:00Z","desc":"On July 27, 2024, a Crescent Midstream frac tank overflowed into secondary containment and eventually entered Bayou Lafourche near Raceland, LA. The oil has impacted at least 3.5 miles of bayou downstream of release site.  Current estimate of oil released to water is over 175bbl.. Threat: Oil. Commo","url":""},{"id":"10825","title":"Cargo Ship HANS SHULTE Potential Hazmat Release; Gulf of Mexico","lat":28.6861,"lon":-89.4452,"date":"2024-07-27T00:00:00Z","desc":"On July 27, 2024, the USCG Sector New Orleans received notification of a potential hazmat release aboard the Hong Kong cargo ship HANS SHULTE. The ship is approximately 5nm south of the Louisiana Delta.  The spill was characterized as a white liquid producing a noxious odor.  No impact to the waterw","url":""},{"id":"10819","title":"Tug Miss Peggy Sunk; Houston Shipping Channel, TX - Houston Shipping Channel, TX, USA","lat":29.7616,"lon":-95.0772,"date":"2024-07-19T00:00:00Z","desc":"On 19-JUL-24, USCG Sector Houston contacted NOAA NW RRO about the Tug Miss Peggy that sank near the Lynchberg Ferry route. One crewmember was killed. The cause of the sinking was a collision between the tug and a tanker, not damages to the tanker reported and they have left the area. The Tug Miss Pe","url":""},{"id":"10818","title":"Fishing Vessel Bilge Discharge; South Padre Island, TX - South Padre Island, TX, USA","lat":26.1233,"lon":-97.0717,"date":"2024-07-19T00:00:00Z","desc":"On 19-JUL-24, USCG Sector Corpus Christi called the NOAA NW RRO about a fishing vessel that had inadvertently discharged diesel via bilge due to a diesel tank puncture. The discharge occurred 5 miles offshore during a dewatering operation with USCG and the discharge amount is between 500 – 5,000 gal","url":""},{"id":"10816","title":"Platform Sheen; offshore Bolivar Peninsula, TX - Texas","lat":29.3822,"lon":-94.4842,"date":"2024-07-17T00:00:00Z","desc":"On July 17, 2024, NESDIS issued a Marine Pollution Surveillance Report (MPSR), for an anomaly offshore Bolivar Peninsula.  The location of the anomaly approximately corresponds with two earlier National Response Center reports (#1404970, 1404788), which also reported sheens in that general location.","url":""},{"id":"10812","title":"Well Flowline Spill in Bayou Perot; Lafitte, LA - Lafitte, LA, USA","lat":29.6347,"lon":-90.1764,"date":"2024-07-11T00:00:00Z","desc":"On July 11, 2024, the TPIC reported that a flowline in Bayou Perot associated with Well #98 has released 25 gal of crude oil into the marsh and adjacent waterway. The USCG is investigating.. Threat: Oil. Commodity: crude","url":""},{"id":"10811","title":"Hurricane Beryl; Yucatan Peninsula, Mexico - Matagorda, TX","lat":28.6667,"lon":-95.95,"date":"2024-07-05T00:00:00Z","desc":"As of approximately 1700 central time, on July  5, 2024, Beryl was passing over the Yucatan Peninsula.  NHC Forecast Trajectory shows the storm making landfall in the Coastal Bend area of Texas sometime Monday morning as a strong Cat 1 hurricane.  ERD currently has no requests, but SSC is in contact","url":""},{"id":"10809","title":"Mystery Sheen, Main Pass 80; off coast of Louisiana - Mississippi River Delta","lat":29.2153,"lon":-89.0439,"date":"2024-06-26T00:00:00Z","desc":"On June 26, 2024, the USCG received a NESDIS report in Main Pass 80.  USCG Auxiliary overflight confirmed the presence of sheen and dark oil for approximately 6 miles.  The USCG is investigating and requested a trajectory analysis. Threat: Oil","url":""},{"id":"10804","title":"Pipeline Spill at Delta Farms Oil Field, In Situ Burn; Lafitte, LA - Lafitte, LA, USA","lat":29.6427,"lon":-90.1869,"date":"2024-06-18T00:00:00Z","desc":"On 18 June 2024 a 6-inch TPIC flowline located in the Delta Farms Oil Field released approximately 40 bbl of crude oil into the marsh.  The release is secured. Containment boom is in place to prevent impact to the adjacent waterway. An in-situ burn is under consideration.. Threat: Oil. Commodity: cr","url":""},{"id":"10793","title":"Hydraulic Fluid Discharge; Offshore Freeport, TX","lat":28.8753,"lon":-95.2622,"date":"2024-05-31T00:00:00Z","desc":"On May 30, 2024, at approximately 2200 local, an estimated 100 gallons of hydraulic fluid was discharged from a dump scale being towed by a barge approximately 3 miles offshore Freeport, TX (NRC#1400428).  MSU Texas City contacted NOAA SSC to inquire if a sheen or slick was visible on satellite imag","url":""},{"id":"10792","title":"Cow Bayou Tank Farm Discharge; Orange, TX","lat":30.0747,"lon":-93.8458,"date":"2024-05-30T00:00:00Z","desc":"On May 29, 2024, a tank battery in Orangefield, TX, was struck by lightning, damaging the tank.  An estimated 40 bbl of crude oil was discharged into Cow Bayou.  OSRO is on site, boom placed.  EPA is overseeing.  State jurisdiction is TRRC (land) and TGLO (water).  The NOAA SSC was notified by TPWD ","url":""},{"id":"10789","title":"80-foot Yacht Atlantis Taking on Water; St. Augustine, FL - St. Augustine, FL, USA","lat":29.8655,"lon":-81.2367,"date":"2024-05-25T00:00:00Z","desc":"On May 25, 2024, the USCG Sector Jacksonville reported the 80-foot yacht, the Atlantis, was sinking off St. Augustine, FL. All persons onboard were rescued. The USCG requested oil fate and potential for shoreline impact for the 1000 gallons of diesel fuel onboard. The water depth at the location is ","url":""},{"id":"10787","title":"Natural Gas Condensate Release at Lake Pelto; Cocodrie, LA - Cocodrie, LA, USA","lat":29.127,"lon":-90.6526,"date":"2024-05-18T00:00:00Z","desc":"On May 18, 2024, the USCG notified the NOAA Scientific Coordinator that a TPIC (Texas Petroleum Investment Company) well in Lake Pelto was releasing natural gas and condensate into the air.  The release is thought to be the result of a strike from a shrimping vessel.  The release has not yet been se","url":""},{"id":"10786","title":"Pelican Island Bridge Allision; Galveston, TX - Galveston, TX, USA","lat":29.3127,"lon":-94.8222,"date":"2024-05-15T00:00:00Z","desc":"On May 15, 2024, the USCG contacted the ERD Duty Officer to request support on a tug and barge accident.  The tug and barge hit the Pelican Island bridge in Galveston, TX, spilling vacuum gas oil.  Other details are pending. Trajectory was requested.. Threat: Oil. Commodity: Vacuum Gas Oil (API 26)","url":""},{"id":"10784","title":"Waste Oil Discharge, Tucker's Bayou; Deer Park, TX","lat":29.7329,"lon":-95.0982,"date":"2024-05-11T00:00:00Z","desc":"On May 11, 2024, an unknown amount of waste oil from tank washings was discharged into Tucker's Bayou, a sub-estuary of Buffalo Bayou (aka Upper Houston Ship Channel) NRC#1398647.  Oil-water mixture discharged from a drainage culvert into a heavily vegetated area in the upper end of the Tucker Bayou","url":""},{"id":"10773","title":"Pipeline Leak, West Cameron Lease Block 564; Offshore Louisiana","lat":28.305,"lon":-93.2694,"date":"2024-04-24T00:00:00Z","desc":"On April 20, 2024, Energy Transfer reported a pinhole leak from a 30-inch pipeline in the West Cameron lease block.  The discharge is reported as condensate from a natural gas line.  The line is reported to be in the process of being shut in.  On April 24, the Louisiana Oil Spill Coordinator's Offic","url":""},{"id":"10768","title":"Floating Tar Patties from Dismantling of Hilcorp Boudreaux Canal Barge; Chauvin, LA - Chauvin, LA, USA","lat":29.472,"lon":-90.6148,"date":"2024-04-04T00:00:00Z","desc":"On April 3, 2024, USCG received a report of floating tar patties released from the dismantling of a Hilcorp barge.  Tar patties were observed impacting a marsh shoreline in the area of the release.  Cleanup is underway.  The USCG requested the NOAA SSC provide on-site support.. Threat: Oil. Commodit","url":""},{"id":"10760","title":"Horsepen Bayou Crude Oil and Produced Water Discharge; Houston, TX - Houston, TX,","lat":29.5781,"lon":-95.164,"date":"2024-03-25T00:00:00Z","desc":"On March 25, 2024, the secondary containment at a tank battery owned by Denbury Resources discharged an estimated 3-5 bbls of crude oil and produced water mix into a drainage ditch leading to Horsepen Bayou, located in Harris County, TX . Sector Houston-Galveston responded as first Federal on-scene,","url":""},{"id":"10758","title":"Mystery Oil Spill; Breton Sound, LA","lat":29.5783,"lon":-89.1172,"date":"2024-03-20T00:00:00Z","desc":"On March 20, 2024, the  UCCG received reports of a mystery slick in Breton Sound from two local OSROs.  The slick was spotted at 10:30 am and appeared to be moving to the southeast.  No estimate on quantity or size at this time.  Photos available in post. NOAA initial trajectory suggests possible sh","url":""},{"id":"10753","title":"Midsteam Pipeline Mississippi River Spill; Buras-Triumph, LA - Buras-Triumph, LA, USA","lat":29.3731,"lon":-89.5525,"date":"2024-03-13T00:00:00Z","desc":"On March 13, 2024,  Midstream Pipeline Company reported an approximate 6 bbl spill onto land from the filtration system at the Chevron Empire Dock.  Oil has impacted the adjacent vegetation and the Mississippi River.  Cleanup is underway.  The USCG requested assistance with cleanup techniques.. Thre","url":""},{"id":"10752","title":"In Situ Burn of Oil Spill at Whitney Oil & Gas, Lake Hatch B-42; Houma, LA - Houma, LA, USA","lat":29.528,"lon":-90.856,"date":"2024-03-08T00:00:00Z","desc":"On March 6, 2024, Whitney Oil & Gas reported an approximate 5bbl spill into marsh and adjacent waterway from a 3-in test line associated with well #66. NRC #1393204.  An in-situ burn is being considered.. Threat: Oil. Commodity: oil","url":""},{"id":"10747","title":"Hydraulic Fluid Discharge from Jack-up Rig; Gulf State Park Pier; Gulf Shores, AL - Gulf State Park Pier, 20800 E Beach ","lat":30.2466,"lon":-87.6678,"date":"2024-02-20T00:00:00Z","desc":"On 20 FEB 2024, USCG Sector Mobile contacted the NOAA SSC regarding a discharge of hydraulic fluid that occurred on 14 FEB from a jackup rig located at the Gulf State Park Pier. SSC provided fate information on hydraulic fluids.. Threat: Oil","url":""},{"id":"10744","title":"Dead North Atlantic Right Whale; floating off the coast of Georgia - Off coast of Georgia","lat":31.9518,"lon":-80.4762,"date":"2024-02-14T00:00:00Z","desc":"On 14 Feb 2024, the Coordinator for NOAA's Marine Mammal Health and Stranding Response Program requested a hindcast model from OR&R for a reported and confirmed whale strike. The request was forwarded to OR&R oceanographers.. Threat: Other","url":""},{"id":"10738","title":"Heavy Fuel Oil Discharge into Galveston Bay; Texas City, TX","lat":29.3719,"lon":-94.8853,"date":"2024-02-09T00:00:00Z","desc":"On February 6, 2024, a loading arm at Marathon Dock 40, Texas City, discharged oil into Galveston Bay during maintenance. On February 9, MSU Texas City contacted NOAA SSC for advice on clean up methods for oiled vegetation, and barges.  Phone support provided.. Threat: Oil. Commodity: Heavy Oil","url":""},{"id":"10737","title":"Crude Oil Spill into Black Lake, Hackberry, LA - Black Lake, Hackberry, LA, USA","lat":30.0142,"lon":-93.4168,"date":"2024-02-08T00:00:00Z","desc":"On February 8, 2024, the USCG notified NOAA ERD of an approximately 4-barrel crude oil spill into Black Lake, LA.  Release came from a 4-inch pipeline.  The source is reported to be secured.  USCG requested a trajectory.. Threat: Oil. Commodity: crude","url":""},{"id":"10727","title":"Naptha Discharge, San Jacinto River, Channelview, TX","lat":29.7756,"lon":-95.075,"date":"2024-01-26T00:00:00Z","desc":"On January 24, 2024, a barge collision on the San Jacinto River caused a hole in one tank of a barge, discharging approximately 400 bbls of naptha into the water (NRC#1390028).  Sector Houston-Galveston contacted NOAA SSC for input on fate and effects.  Phone support provided.  OSROs responding, no ","url":""},{"id":"10726","title":"Sulfuric Acid Drum, Corpus Christi Inner Harbor; Corpus Christi, TX","lat":27.8119,"lon":-97.41,"date":"2024-01-25T00:00:00Z","desc":"On January 25, 2024, at approximately 1530 local, a 55-gallon drum containing an acid solution (concentration unknown) was dropped into the Corpus Christi Inner Harbor during vessel transfer operations at Cargo Dock 15. Drum was reported intact at the time it entered the water (NRC#1389950.  Sector ","url":""},{"id":"10719","title":"Naptha Discharge; Houston Ship Channel, TX - Houston, Texas","lat":29.7428,"lon":-95.2028,"date":"2024-01-20T00:00:00Z","desc":"NOTIFICATION ONLY\u000bEarly in the morning of January 20, 2024, a barge allision at Magellan Terminals, located in the upper Houston Ship Channel, discharged an estimated 50 bbls of naptha into the channel.  At time of Sector Houston's notification, discharge was partially contained, no support requeste","url":""},{"id":"10723","title":"TPIC Sweet Lake Discharge; Cameron, LA","lat":29.8953,"lon":-93.1361,"date":"2024-01-19T00:00:00Z","desc":"On January 18,2024, a TPIC facility in Sweet Lake, LA discharged an estimated 30 gallons of high paraffin crude oil into the water.  On January 19, 2024 MSU Lake Charles requested review of the initial consultation request.  NOAA SSC reviewed notification and provided comments.. Threat: Oil. Commodi","url":""},{"id":"10716","title":"Mystery Sheen; vicinity of Coquille Bay, LA - Pilottown, LA, USA","lat":29.135,"lon":-89.3039,"date":"2024-01-07T00:00:00Z","desc":"On January 7, 2024, the USCG Sector New Orleans contacted the NOAA SSC regarding a reported discharge of oil that occurred this morning from a wellhead in vicinity of Coquille Bay, LA.  No oil was observed at the wellhead location during an overflight around 1530 but a possible sheen (see photos) wa","url":""},{"id":"10715","title":"Widespread Unknown Odor; area of Corpus Christi, TX","lat":27.8959,"lon":-97.3183,"date":"2024-01-04T00:00:00Z","desc":"On January 4, 2024 emergency management offices in several counties in the Corpus Christi area received multiple reports of an unknown odor.  Odor was described various ways, as sulfur- or ammonia like.  No source has been identified.  Initial reports were received beginning around 2100 local on Jan","url":""}]}